// Завдання 1: Запити та Результати Запитів

// Виберіть всі елементи <p> та змініть їхній текст на "Змінений текст"
$("p").text("Змінений текст");

// Виберіть елемент з ідентифікатором task1 та додайте йому клас highlight
$("#task1").addClass("highlight");

// Виберіть всі елементи <li> та додайте їм клас list-item
$("li").addClass("list-item");

// Завдання 2: Селектори

// Змініть колір тексту всіх елементів з класом highlight на червоний
$(".highlight").css("color", "red");

// Змініть фон всіх елементів з класом list-item на світло-сірий
$(".list-item").css("background-color", "#cccccc");

// Завдання 3: Анімація

// Зробіть анімаційний ефект для елементів з класом highlight (наприклад, fadeIn або slideDown)
$(".highlight").fadeIn(1000);

// Завдання 4: Зміна вмісту

// Змініть текст останнього елемента <р> у блоці з ідентифікатором task 1 на "Новий останній текст"
$("#task1 > p:last").text("Новий останній текст");

// Додаткове завдання:

// Створіть кнопку на сторінці

// Додайте обробник подій для цієї кнопки, який буде видаляти всі елементи з класом "list-item"
$("button").click(function() {
$(".list-item").remove();
});
